unit uProjectConsts;

(*******************************************************************************************)
(*            _____          _____          _____          _____          _____            *)
(*           /\    \        /\    \        /\    \        /\    \        /\    \           *)
(*          /::\____\      /::\    \      /::\    \      /::\    \      /::\    \          *)
(*         /:::/    /      \:::\    \    /::::\    \    /::::\    \    /::::\    \         *)
(*        /:::/    /        \:::\    \  /::::::\    \  /::::::\    \  /::::::\    \        *)
(*       /:::/    /          \:::\    \ :::/\:::\    \ :::/\:::\    \ :::/\:::\    \       *)
(*      /:::/    /            \:::\    \ :/__\:::\    \ :/__\:::\    \ :/__\:::\    \      *)
(*     /:::/    /             /::::\    \ \   \:::\    \ \   \:::\    \ \   \:::\    \     *)
(*    /:::/    /     _____   /::::::\    \ \   \:::\    \ \   \:::\    \ \   \:::\    \    *)
(*   /:::/    /     /\    \ /:::/\:::\    \ \   \:::\ ___\ \   \:::\    \ \   \:::\____\   *)
(*  /:::/____/     /::\    /:::/  \:::\____\ \   \:::|    | \   \:::\____\ \   \:::|    |  *)
(*  \:::\    \     \:::\  /:::/    \::/    / :\  /:::|____| :\   \::/    / :\  /:::|____|  *)
(*   \:::\    \     \:::\/:::/    / \/____/ :::\/:::/    / :::\   \/____/ :::\/:::/    /   *)
(*    \:::\    \     \::::::/    /  \:::\   \::::::/    /  \:::\    \  |:::::::::/    /    *)
(*     \:::\    \     \::::/____/    \:::\   \::::/    /    \:::\____\ |::|\::::/    /     *)
(*      \:::\    \     \:::\    \     \:::\  /:::/    / :\   \::/    / |::| \::/____/      *)
(*       \:::\    \     \:::\    \     \:::\/:::/    / :::\   \/____/  |::|  ~|            *)
(*        \:::\    \     \:::\    \     \::::::/    /  \:::\    \      |::|   |            *)
(*         \:::\____\     \:::\____\     \::::/    /    \:::\____\     \::|   |            *)
(*          \::/    /      \::/    /      \::/____/      \::/    /      \:|   |            *)
(*           \/____/        \/____/        ~~             \/____/        \|___|            *)
(*                                                                                         *)
(*******************************************************************************************)

interface

const

  SC_ExpressionKey_VDP = 'd';

  SC_ExceptionFormat = '%s: %s';
  SC_ErrorFormat     = 'Error: %s';
  SC_WrapperFormat   = '%s (%s)';

  IC_EvalResultStrLength  = 16384;
  SC_FormCaption          = '%s for %s';
  IC_MaxHistoryCount      = 30;

{ TStringValueReplacer }

  SC_StringValueReplacer_Name =

      'String value replacer for Delphi';

  SC_StringValueReplacer_Description =

      'Заменитель значения типа String для отладчика Дельфи. Для выражения с ключом ''d'' ' +
      'заменяет дефолтное представление строки со спецсимволами в шестнадцатеричном виде ' +
      'на обычную строку.';

{ TGUIDValueReplacer }

  SC_GUIDValueReplacer_Name =

      'TGUID value replacer for Delphi';

  SC_VariantValueReplacer_Name =

      'Variant value replacer for Delphi';

  SC_GUIDValueReplacer_Description =

      'Заменитель значения типа TGUID для отладчика Дельфи. Для выражения с ключом ''d'' ' +
      'заменяет дефолтное представление GUID в виде записи его строковым представлением.';

  SC_VariantValueReplacer_Description =

      'Заменитель значения типа Variant для отладчика Дельфи. Для выражения с ключом ''d'' ' +
      'заменяет дефолтное представление Variant его развернутым содержимым.';

implementation

end.
